Repository: Centaur/lua-nginx-module
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: On a ThinkPad T400 2.80 GHz laptop, the Hello World example readily achieves 28k req/sec using <code>http_load -p 10</code>.
zh_cn: 在一个 ThinkPad T400 2.80 GHz 笔记本上, 使用 <code>http_load -p 10</code>， Hello World例子轻松达到 28k req/sec .

source: On the other hand, the following will not work as expected:
zh_cn: 而下面的代码将不能得到预期的结果:

source: One can also create infinite re-occuring timers, for instance, a timer getting triggered every <code>5</code> seconds, by calling <code>ngx.timer.at</code> recursively in the timer callback function.
zh_cn: 也可以通过在回调函数里递归调用 <code>ngx.timer.at</code>创建无限次重复调用的定时器, 例如, 每 <code>5</code> 秒触发一次的定时器.

source: One can specify fractional seconds like <code>0.001</code> to mean 1 millisecond here.
zh_cn: 可以用小数点如 <code>0.001</code> 表示 1 毫秒.

source: One can specify time resolution up to 0.001 seconds (i.e., one milliseconds).
zh_cn: 时间的精度可以到 0.001 seconds (即毫秒).

source: Only Lua tables are accepted (Only the last element in the table will take effect for standard headers such as <code>Content-Type</code> that only accept a single value).
zh_cn: 仅支持 Lua table (对于只支持单个值的标准头如<code>Content-Type</code>，只有table中的最后一个元素起作用

source: Only [[#tcpsock:receive|receive]] and [[#tcpsock:receiveuntil|receiveuntil]] methods are supported on this object.
zh_cn: 此对象只支持 [[#tcpsock:receive|receive]] 和 [[#tcpsock:receiveuntil|receiveuntil]] 方法.

source: Only a small set of the [[#Nginx API for Lua|Nginx API for Lua]] is supported in this context:
zh_cn: 这个上下文中只支持很少一部分 [[#Nginx API for Lua|Nginx API for Lua]] :

source: Only the direct "parent coroutine" can wait on its child "light thread", otherwise a Lua exception will be raised.
zh_cn: 只有直接的"父coroutine"可以等待子"轻量线程", 否则会抛出Lua异常.

source: Only the first occurrence of the match is returned, or <code>nil</code> if no match is found.
zh_cn: 只返回第一个匹配项, 无匹配则返回<code>nil</code>.

source: Original request headers should be ignored by setting [[HttpProxyModule#proxy_pass_request_headers|proxy_pass_request_headers]] to <code>off</code> in subrequest locations.
zh_cn: 在子请求的location中应设置 [[HttpProxyModule#proxy_pass_request_headers|proxy_pass_request_headers]] 为 <code>off</code>来忽略主请求的头.

source: Other scripting language implementations typically struggle to match this performance level.
zh_cn: 其它的脚本语言实现一般都很难达到这个级别的性能.

source: Otherwise, it returns <code>nil</code> and a string describing the error.
zh_cn: 否则返回 <code>nil</code> 和描述错误的字符串.

source: Overrides the current request's request method with the <code>request_id</code> argument.
zh_cn: 用<code>request_id</code>参数覆盖当前请求的请求方法.

source: Overriding <code>ngx.ctx</code> with a new Lua table is also supported, for example,
zh_cn: 用一个新的Lua table来覆盖 <code>ngx.ctx</code> 也是支持的, 例如,

source: Parse the http time string (as returned by [[#ngx.http_time|ngx.http_time]]) into seconds.
zh_cn: 解析http时间字符串 (象 [[#ngx.http_time|ngx.http_time]] 的返回值) 得到秒数.

source: Pending timers are those timers that have not expired yet.
zh_cn: 未过期定时器指尚未过期的定时器.

source: Please also refer to restrictions on capturing locations configured by [[#Locations_Configured_by_Subrequest_Directives_of_Other_Modules|subrequest directives of other modules]].
zh_cn: 请参阅 [[#Locations_Configured_by_Subrequest_Directives_of_Other_Modules|其它模块的子请求命令]]了解子请求location的限制.

source: Please ensure that the file specified by the <code>file_name</code> argument exists and is readable by an Nginx worker process by setting its permission properly to avoid Lua exception errors.
zh_cn: 请保证 <code>file_name</code> 参数指定的文件真实存在，并且正确设置其访问权限，便利Nginx worker进程能够访问它，以避免抛出Lua异常.

source: Please note however, that Lua code written inlined within nginx.conf such as those specified by [[#set_by_lua|set_by_lua]], [[#content_by_lua|content_by_lua]], [[#access_by_lua|access_by_lua]], and [[#rewrite_by_lua|rewrite_by_lua]] will ''always'' be cached because only the Nginx config file parser can correctly parse the <code>nginx.conf</code> file and the only ways to to reload the config file are to send a <code>HUP</code> signal or to restart Nginx.
zh_cn: 但是请注意，在nginx.conf中内置写入的 Lua 代码，如 [[#set_by_lua|set_by_lua]], [[#content_by_lua|content_by_lua]], [[#access_by_lua|access_by_lua]], 和 [[#rewrite_by_lua|rewrite_by_lua]]中的，将“总是”被缓存，因为只有 Nginx 配置文件解析器能够正确解析 <code>nginx.conf</code> 文件，重新加载配置文件的方法是发送 <code>HUP</code> 信号或重启 Nginx.

source: Please note that both <code>ngx.print</code> and [[#ngx.say|ngx.say]] will always invoke the whole Nginx output body filter chain, which is an expensive operation.
zh_cn: 请注意 <code>ngx.print</code> 和 [[#ngx.say|ngx.say]] 都将启动整个 Nginx 输出体过滤器链, 开销比较大.

source: Please note that ignoring request body is not the right way to discard it, and that this function must be called to avoid breaking things under HTTP 1.1 keepalive or HTTP 1.1 pipelining.
zh_cn: 请注意，无视请求体（译注：无视指认为请求体不存在，与本方法的不同是不会从连接中读取请求体数据）不是丢弃它的正确方法, 因此必须调用本方法来防止在HTTP 1.1 keepalive 或 HTTP 1.1 pipelining时出错.

source: Please note that the bytecode format used by LuaJIT 2.0 is not compatible with that used by the standard Lua 5.1 interpreter.
zh_cn: 请注意 LuaJIT 2.0 使用的字节码格式与标准Lua 5.1解释器使用的格式不兼容.

source: Please note that while internally the key-value pair is set atomically, the atomicity does not go across the method call boundary.
zh_cn: 请注意虽然在内部实现中key-value对的写入是原子操作，但其原子性并不跨越方法调用的边界.

source: Please refer to the official LuaJIT documentation on the <code>-b</code> option for more details:
zh_cn: 请参阅官方 LuaJIT 文档了解 <code>-b</code> 选项的细节:

source: Please submit bug reports, wishlists, or patches by
zh_cn: 请用以下方法提交bug，功能需求或补丁

source: Please use LuaJIT 2.0, which supports a fully resumable VM, to avoid this.
zh_cn: 请使用 LuaJIT 2.0, 它支持完全可恢复虚拟机, 来避免这个问题.

source: Possible return values are
zh_cn: 可能的返回值有

source: Premature timer expiration happens when the Nginx worker process is trying to shut down, as in an Nginx configuration reload triggered by the <code>HUP</code> signal or in an Nginx server shutdown.
zh_cn: 过早的定时器过期的发生是<code>HUP</code>导致重新加载Nginx配置或Nginx服务器关闭导致Nginx worker进程尝试关闭.

source: Puts the current socket's connection immediately into the cosocket built-in connection pool and keep it alive until other [[#tcpsock:connect|connect]] method calls request it or the associated maximal idle timeout is expired.
zh_cn: 立即将当前socket的连接存入 cosocket 内置连接池，保持其存活状态，直接对其再次调用 [[#tcpsock:connect|connect]] 或设置的最大空闲时间到期了.

source: Read and write Nginx variable values.
zh_cn: 读写Nginx变量的值.

source: Read and write the current request's response status.
zh_cn: 读写当前请求的响应状态码。

source: Reading <code>ngx.header.HEADER</code> will return the value of the response header named <code>HEADER</code>.
zh_cn: 读取 <code>ngx.header.HEADER</code> 将返回名为 <code>HEADER</code>的响应头.

source: Reads the client request body synchronously without blocking the Nginx event loop.
zh_cn: 同步读取客户端请求体，但是不阻塞Nginx事件循环.

source: Receives data from the UDP or datagram unix domain socket object with an optional receive buffer size argument, <code>size</code>.
zh_cn: 从UDP或数据报unix domain socket对象接收数据，可用 <code>size</code> 指定缓冲区大小.

source: Receives data from the connected socket according to the reading pattern or size.
zh_cn: 根据指定的读取模式或大小从已连接的socket中读取数据.

source: Redirecting arbitrary external URLs is also supported, for example:
zh_cn: 也支持重定向到任意的外部URLs , 例如:

source: Regardless of the presence of the <code>pos</code> field in the <code>ctx</code> table, <code>ngx.re.match</code> will always set this <code>pos</code> field to the position ''after'' the substring matched by the whole pattern in case of a successful match.
zh_cn: 不管<code>ctx</code> table中是否有 <code>pos</code> ， <code>ngx.re.match</code>在成功匹配后，都会将 <code>pos</code> 的值置为整个模板匹配到的子串的后一位.

source: Registers a user Lua function as the callback which gets called automatically when the client closes the (downstream) connection prematurely.
zh_cn: 将一个用户Lua函数注册成为回调函数，当客户端过早关闭（下游）连接时会调用此回调函数.

source: Removing the <code>max_args</code> cap is strongly discouraged.
zh_cn: 强烈不建议去掉<code>max_args</code> 限制.

source: Removing the <code>max_headers</code> cap is strongly discouraged.
zh_cn: 去除<code>max_headers</code> 限制是非常不推荐的.

source: Request <code>GET /lua</code> will give the output
zh_cn: <code>GET /lua</code> 的结果是

source: Request <code>GET /lua</code> yields the output
zh_cn: 请求 <code>GET /lua</code> 的结果

source: Resumes the executation of a user Lua coroutine object previously yielded or just created.
zh_cn: 恢复一个之前挂起或刚创建的用户Lua coroutine的执行.

source: Retrieves in-memory request body data.
zh_cn: 获取内存中的请求体数据.

source: Retrieves the current request's request method name.
zh_cn: 获得当前请求的请求方法名称.

source: Retrieves the current running phase name.
zh_cn: 返回当前运行的阶段名称.

source: Retrieves the file name for the in-file request body data.
zh_cn: 获取文件中请求体数据的文件名.

source: Retrieving the value in the dictionary [[#ngx.shared.DICT|ngx.shared.DICT]] for the key <code>key</code>.
zh_cn: 获取字典 [[#ngx.shared.DICT|ngx.shared.DICT]] 中键 <code>key</code> 所对应的值.

source: Returns <code>1</code> if the callback is registered successfully or returns <code>nil</code> and a string describing the error otherwise.
zh_cn: 注册成功返回<code>1</code> 否则返回 <code>nil</code> 和错误字符串.

source: Returns <code>nil</code> for unrecognized values.
zh_cn: 遇到不支持的版本号返回<code>nil</code>.

source: Returns <code>nil</code> if <code>str</code> is not well formed.
zh_cn: 如果<code>str</code>格式错误将返回<code>nil</code>.

source: Returns <code>nil</code> if the request body has not been read or has been read into memory.
zh_cn: 如果请求体尚未被读取或已经被读入内存，将返回<code>nil</code>。

source: Returns <code>true</code> if the current request is an nginx subrequest, or <code>false</code> otherwise.
zh_cn: 如果当前请求是nginx子请求，返回<code>true</code> 否则返回 <code>false</code> .

source: Returns <code>true</code> if the response headers have been sent (by ngx_lua), and <code>false</code> otherwise.
zh_cn: 如果响应头已经被(ngx_lua)发送，返回 <code>true</code>，否则返回 <code>false</code> .

source: Returns a 3rd value, <code>stale</code>, indicating whether the key has expired or not.
zh_cn: 同时返回第3个值, <code>stale</code>, 指明此键是否已过期.

source: Returns a Lua table holding all the current request POST query arguments (of the MIME type <code>application/x-www-form-urlencoded</code>).
zh_cn: 返回当前所有请求的POST请求参数 (MIME类型为 <code>application/x-www-form-urlencoded</code>).

source: Returns a Lua table holding all the current request URL query arguments.
zh_cn: 返回存有当前请求URL请求参数的Lua table.

source: Returns a Lua table holding all the current request headers.
zh_cn: 返回持有当前请求所有头的Lua table.

source: Returns a Lua table with three slots (<code>res.status</code>, <code>res.header</code>, <code>res.body</code>, and <code>res.truncated</code>).
zh_cn: 返回一个Lua table，内容包括三项 (<code>res.status</code>, <code>res.header</code>, <code>res.body</code>, and <code>res.truncated</code>).

source: Returns a Lua thread (or Lua coroutine) object represents this "light thread".
zh_cn: 返回代表这个''轻量线程''的Lua线程 (或称 Lua coroutine) .

source: Returns a floating-point number for the elapsed time in seconds (including milliseconds as the decimal part) from the epoch for the current time stamp from the nginx cached time (no syscall involved unlike Lua's date library).
zh_cn: 从nginx缓存的时间返回浮点数形式的从公元纪年到当前时间的秒数（小数部分是毫秒数） (不象Lua date库，这里没有系统调用).

source: Returns a floating-point number representing the timestamp (including milliseconds as the decimal part) when the current request was created.
zh_cn: 返回表示当前请求创建时间的浮点数 (小数部分为毫秒).

source: Returns a formated string can be used as the cookie expiration time.
zh_cn: 返回按cookie超时时间格式化的时间字符串.

source: Returns a formated string can be used as the http header time (for example, being used in <code>Last-Modified</code> header).
zh_cn: 返回http头中时间格式的时间字符串 (例如 <code>Last-Modified</code> 头).

source: Returns a quoted SQL string literal according to the MySQL quoting rules.
zh_cn: 根据MySQL的引号规则返回对参数进行转义.

source: Returns a read-only cosocket object that wraps the downstream connection.
zh_cn: 返回包装了下游连接的只读cosocket对象.

source: Returns current date (in the format <code>yyyy-mm-dd</code>) from the nginx cached time (no syscall involved unlike Lua's date library).
zh_cn: 从nginx缓存的时间中返回当前日期 (格式为<code>yyyy-mm-dd</code>) (不象Lua date库，这里没有系统调用).

source: Returns the HTTP version number for the current request as a Lua number.
zh_cn: 以Lua number的形式返回当前请求的HTTP版本号.

source: Returns the binary form of the MD5 digest of the <code>str</code> argument.
zh_cn: 返回<code>str</code>MD5文摘的二进制数据.

source: Returns the binary form of the SHA-1 digest of the <code>str</code> argument.
zh_cn: 返回<code>str</code>SHA-1文摘的二进制数据.

source: Returns the current time stamp (in the format <code>yyyy-mm-dd hh:mm:ss</code>) of the nginx cached time (no syscall involved unlike Lua's [http://www.lua.org/manual/5.1/manual.html#pdf-os.date os.date] function).
zh_cn: 从nginx缓存的时间中返回当前时间戳 (格式为<code>yyyy-mm-dd hh:mm:ss</code>) (不象Lua 的[http://www.lua.org/manual/5.1/manual.html#pdf-os.date os.date]函数，这里没有系统调用).

source: Returns the elapsed seconds from the epoch for the current time stamp from the nginx cached time (no syscall involved unlike Lua's date library).
zh_cn: 从nginx缓存的时间返回从公元纪年到当前时间的秒数 (不象Lua date库，这里没有系统调用).

source: Returns the hexadecimal representation of the MD5 digest of the <code>str</code> argument.
zh_cn: 返回<code>str</code>MD5文摘的16进制文本串.

source: Returns the new resulting number if the operation is successfully completed or <code>nil</code> and an error message otherwise.
zh_cn: 如果成功，返回结果值否则返回 <code>nil</code> 和错误信息.

source: Returns the number of items that have actually been flushed.
zh_cn: 返回实际被清除的项的数目。

source: Returns the original raw HTTP protocol header received by the Nginx server.
zh_cn: 返回Nginx服务器接收到的原始HTTP协议头.

source: Returns the seconds or <code>nil</code> if the input string is in bad forms.
zh_cn: 如果输入字符串格式不对，返回 <code>nil</code> .

source: Returns three values:
zh_cn: 返回3个值:

source: Rewrite the current request's (parsed) URI by the <code>uri</code> argument.
zh_cn: 用<code>uri</code>参数覆盖当前请求的 (解析过的) URI.

source: Rewrite the current request's URI query arguments by the <code>args</code> argument.
zh_cn: 用<code>args</code>覆盖当前请求的URI请求参数.

source: Run the Lua source code inlined as the <code><lua-script-str></code> at the <code>log</code> request processing phase.
zh_cn: 在请求处理的 <code>log</code> 阶段运行<code><lua-script-str></code>中的lua代码.

source: Running timers are those timers whose user callback functions are still running.
zh_cn: 正在运行的定时器指用户指定的回调函数仍在运行的定时器。

source: Runs the Lua code specified by the argument <code><lua-script-str></code> on the global Lua VM level when the Nginx master process (if any) is loading the Nginx config file.
zh_cn: 在Nginx主进程（如果存在的话）加载Nginx配置文件时在全局Lua虚拟机级别运行由参数<code><lua-script-str></code>指定的Lua代码

source: See HTTP method constants methods other than POST.
zh_cn: 除POST外还有其它的HTTP方法常量。

source: See [[#Data_Sharing_within_an_Nginx_Worker|Data Sharing within an Nginx Worker]] for the reasons behind this.
zh_cn: 参阅 [[#Data_Sharing_within_an_Nginx_Worker|Data Sharing within an Nginx Worker]] 了解背后的原因.

source: See [[#HTTP 1.0 support|HTTP 1.0 support]].
zh_cn: 参阅 [[#HTTP 1.0 support|HTTP 1.0 支持]].

source: See [[#ngx.flush|ngx.flush]] for more details.
zh_cn: 详情参阅 [[#ngx.flush|ngx.flush]] .

source: See [[#ngx.md5_bin|ngx.md5_bin]] if the raw binary MD5 digest is required.
zh_cn: 如果需要MD5文摘的二进制数据用 [[#ngx.md5_bin|ngx.md5_bin]].

source: See [[#ngx.md5|ngx.md5]] if the hexadecimal form of the MD5 digest is required.
zh_cn: 如果需要十六进制文本串，使用[[#ngx.md5|ngx.md5]].

source: See [[#ngx.shared.DICT|ngx.shared.DICT]] for details.
zh_cn: 详情见[[#ngx.shared.DICT|ngx.shared.DICT]] .

source: See also [[#lua_check_client_abort|lua_check_client_abort]].
zh_cn: 参阅[[#lua_check_client_abort|lua_check_client_abort]].

source: See also [[#ngx.now|ngx.now]] and [[#ngx.update_time|ngx.update_time]].
zh_cn: 参阅 [[#ngx.now|ngx.now]] 和 [[#ngx.update_time|ngx.update_time]].

source: See also [[#ngx.on_abort|ngx.on_abort]].
zh_cn: 参阅 [[#ngx.on_abort|ngx.on_abort]].

source: See also [[#ngx.req.get_body_data|ngx.req.get_body_data]].
zh_cn: 参阅[[#ngx.req.get_body_data|ngx.req.get_body_data]].

source: See also [[#ngx.req.get_body_file|ngx.req.get_body_file]].
zh_cn: 参阅 [[#ngx.req.get_body_file|ngx.req.get_body_file]].

source: See also [[#ngx.req.get_method|ngx.req.get_method]].
zh_cn: 参阅 [[#ngx.req.get_method|ngx.req.get_method]].

source: See also [[#ngx.req.init_body|ngx.req.init_body]].
zh_cn: 参阅 [[#ngx.req.init_body|ngx.req.init_body]].

source: See also [[#ngx.req.read_body|ngx.req.read_body]].
zh_cn: 参阅[[#ngx.req.read_body|ngx.req.read_body]].

source: See also [[#ngx.req.set_body_data|ngx.req.set_body_data]].
zh_cn: 参阅 [[#ngx.req.set_body_data|ngx.req.set_body_data]].

source: See also [[#ngx.req.set_body_file|ngx.req.set_body_file]].
zh_cn: 参阅 [[#ngx.req.set_body_file|ngx.req.set_body_file]].

source: See also [[#ngx.req.set_method|ngx.req.set_method]].
zh_cn: 参阅[[#ngx.req.set_method|ngx.req.set_method]].

source: See also [[#ngx.req.set_uri|ngx.req.set_uri]].
zh_cn: 参阅[[#ngx.req.set_uri|ngx.req.set_uri]].

source: See also [[#ngx.shared.DICT.flush_all|ngx.shared.DICT.flush_all]] and [[#ngx.shared.DICT|ngx.shared.DICT]].
zh_cn: 参阅 [[#ngx.shared.DICT.flush_all|ngx.shared.DICT.flush_all]] 和 [[#ngx.shared.DICT|ngx.shared.DICT]].

source: See also [[#ngx.shared.DICT.flush_expired|ngx.shared.DICT.flush_expired]] and [[#ngx.shared.DICT|ngx.shared.DICT]].
zh_cn: 参阅 [[#ngx.shared.DICT.flush_expired|ngx.shared.DICT.flush_expired]] 和 [[#ngx.shared.DICT|ngx.shared.DICT]].

source: See also [[#ngx.shared.DICT|ngx.shared.DICT]].
zh_cn: 参阅 [[#ngx.shared.DICT|ngx.shared.DICT]].

source: See also [[#ngx.socket.tcp|ngx.socket.tcp]].
zh_cn: 参阅 [[#ngx.socket.tcp|ngx.socket.tcp]].

source: See also [[#ngx.socket.udp|ngx.socket.udp]].
zh_cn: 参阅 [[#ngx.socket.udp|ngx.socket.udp]].

source: Sends data on the current UDP or datagram unix domain socket object.
zh_cn: 在当前的 UDP 或数据报unix domain socket对象上发送数据.

source: Sends data without blocking on the current TCP or Unix Domain Socket connection.
zh_cn: 发送数据，不阻塞当前TCP或Unix domain socket连接.

source: Set the current request's request body using the in-file data specified by the <code>file_name</code> argument.
zh_cn: 将当前请求的请求体设置成<code>file_name</code> 参数指定的文件的内容.

source: Set the current request's request body using the in-memory data specified by the <code>data</code> argument.
zh_cn: 将当前请求的请求体设置成<code>data</code> 参数指定的内存数据 .

source: Set the current request's request header named <code>header_name</code> to value <code>header_value</code>, overriding any existing ones.
zh_cn: 将当前请求名为 <code>header_name</code> 的头的值设为<code>header_value</code>, 替换其当前的值.

source: Set the timeout value in milliseconds for subsequent socket operations ([[#tcpsock:connect|connect]], [[#tcpsock:receive|receive]], and iterators returned from [[#tcpsock:receiveuntil|receiveuntil]]).
zh_cn: 以毫秒为单位设置后续 socket操作([[#tcpsock:connectconnect]], [[#tcpsock:receivereceive]], and iterators returned from [[#tcpsock:receiveuntilreceiveuntil]])的超时时间.

source: Set the timeout value in milliseconds for subsequent socket operations (like [[#udpsock:receive|receive]]).
zh_cn: 设置后续socket操作(如 [[#udpsock:receivereceive]])的超时时间，以毫秒计.

source: Set, add to, or clear the current request's <code>HEADER</code> response header that is to be sent.
zh_cn: 对当前请求的 <code>HEADER</code> 响应头进行设置、添加和清除.

source: Sets the Lua C-module search path used by scripts specified by [[#set_by_lua|set_by_lua]], [[#content_by_lua|content_by_lua]] and others.
zh_cn: 设置由[[#set_by_luaset_by_lua]], [[#content_by_luacontent_by_lua]]或其它指定写入的Lua脚本代码使用的C模块查找路径。

source: Sets the Lua module search path used by scripts specified by [[#set_by_lua|set_by_lua]], [[#content_by_lua|content_by_lua]] and others.
zh_cn: 设置由 [[#set_by_luaset_by_lua]], [[#content_by_luacontent_by_lua]]或其它指令写入的Lua脚本代码使用的Lua模块查找路径.

source: Setting <code>ngx.header.HEADER</code> after sending out response headers (either explicitly with [[#ngx.send_headers|ngx.send_headers]] or implicitly with [[#ngx.print|ngx.print]] and similar) will throw out a Lua exception.
zh_cn: 在发送完响应头 (用 [[#ngx.send_headersngx.send_headers]]显式发送 或 用 [[#ngx.printngx.print]] 和类似方法隐式发送)设置<code>ngx.header.HEADER</code> 将抛出Lua异常.

source: Setting <code>ngx.status</code> after the response header is sent out has no effect but leaving an error message in your nginx's error log file:
zh_cn: 在发送了响应头之后设置 <code>ngx.status</code> 没有作用，但会在ngxin错误日志文件里产生一条错误信息:

source: Setting <code>ngx.var.Foo</code> to a <code>nil</code> value will unset the <code>$Foo</code> Nginx variable.
zh_cn: 将 <code>ngx.var.Foo</code> 设置为 <code>nil</code> 将取消 <code>$Foo</code> Nginx 变量的定义.

source: Setting a slot to <code>nil</code> effectively removes it from the response headers:
zh_cn: 将值设置成 <code>nil</code> 的结果是将它从响应头中删除:

source: Settings done by this method takes priority over those config directives, i.e., [[#lua_socket_connect_timeout|lua_socket_connect_timeout]], [[#lua_socket_send_timeout|lua_socket_send_timeout]], and [[#lua_socket_read_timeout|lua_socket_read_timeout]].
zh_cn: 使用本方法作的设置优先级高于使用配置命令, 包括 [[#lua_socket_connect_timeout|lua_socket_connect_timeout]], [[#lua_socket_send_timeout|lua_socket_send_timeout]], 和 [[#lua_socket_read_timeout|lua_socket_read_timeout]].

source: Settings done by this method takes priority over those config directives, like [[#lua_socket_read_timeout|lua_socket_read_timeout]].
zh_cn: 用本方法作的设置优先级高于使用配置命令如 [[#lua_socket_read_timeout|lua_socket_read_timeout]]等.

source: Similar to [[#ngx.re.match|ngx.re.match]], but returns a Lua iterator instead, so as to let the user programmer iterate all the matches over the <code><subject></code> string argument with the PCRE <code>regex</code>.
zh_cn: 与[[#ngx.re.match|ngx.re.match]]类似, 但返回 a Lua iterator, 使开发者可以遍历所有PCRE <code>regex</code>对<code><subject></code>字符串的匹配结果.

source: Similar to the [[#ngx.shared.DICT.add|add]] method, but never overrides the (least recently used) unexpired items in the store when running out of storage in the shared memory zone.
zh_cn: 类似于 [[#ngx.shared.DICT.add|add]], 但当共享内存区空间不足时不会（以LRU的方式）覆盖未过期的项.

source: Similar to the [[#ngx.shared.DICT.get|get]] method but returns the value even if the key has already expired.
zh_cn: 类似于 [[#ngx.shared.DICT.get|get]] 但即使键过期了，仍返回其值.

source: Similar to the [[#ngx.shared.DICT.set|set]] method, but never overrides the (least recently used) unexpired items in the store when running out of storage in the shared memory zone.
zh_cn: 与 [[#ngx.shared.DICT.set|set]] 类似, 但在共享存储区空间不够时不会(以LRU的方式)覆盖未过期的项.

source: Similar to the standard Lua [http://www.lua.org/manual/5.1/manual.html#pdf-coroutine.create coroutine.create] API, but works in the context of the Lua coroutines created by ngx_lua.
zh_cn: 与标准的Lua [http://www.lua.org/manual/5.1/manual.html#pdf-coroutine.create coroutine.create] API类似, 但工作在由ngx_lua创建的Lua coroutine上下文中.

source: Similar to the standard Lua [http://www.lua.org/manual/5.1/manual.html#pdf-coroutine.resume coroutine.resume] API, but works in the context of the Lua coroutines created by ngx_lua.
zh_cn: 与标准的Lua [http://www.lua.org/manual/5.1/manual.html#pdf-coroutine.resume coroutine.resume] API类似, 但工作在由ngx_lua创建的Lua coroutine上下文中.

source: Similar to the standard Lua [http://www.lua.org/manual/5.1/manual.html#pdf-coroutine.wrap coroutine.wrap] API, but works in the context of the Lua coroutines created by ngx_lua.
zh_cn: 与标准的Lua [http://www.lua.org/manual/5.1/manual.html#pdf-coroutine.wrap coroutine.wrap] API类似, 但工作在由ngx_lua创建的Lua coroutine上下文中.

source: Similar to the standard Lua [http://www.lua.org/manual/5.1/manual.html#pdf-coroutine.yield coroutine.yield] API, but works in the context of the Lua coroutines created by ngx_lua.
zh_cn: 与标准的Lua [http://www.lua.org/manual/5.1/manual.html#pdf-coroutine.yield coroutine.yield] API类似, 但工作在由ngx_lua创建的Lua coroutine上下文中.

source: Similarly, Nginx config
zh_cn: 类似的, Nginx 配置
